MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_MKL25Z4.c
/*------------------------- USBH_Get_Capabilities ------------------------------
 *
 *  Get capabilities of Host Controller Driver
 *
 *  Parameter:  cap:        Pointer to USBH_HCI_CAP structure where 
 *                          capabilities are loaded
 *  Return:
 *----------------------------------------------------------------------------*/

void USBH_Get_Capabilities (USBH_HCI_CAP *cap) {
  cap->MultiPckt = __TRUE;
  cap->MaxDataSz = 512;
  cap->CtrlNAKs  = 10000;
  cap->BulkNAKs  = 1000000;
}


/*------------------------- USBH_Delay_ms --------------------------------------
 *
 *  Delay execution (in milliseconds)
 *  Calibration is done if global variable calDelay is 0
 *
 *  Parameter:  ms:         Number of milliseconds to delay execution for
 *  Return:
 *----------------------------------------------------------------------------*/

static void USBH_Delay_ms (U32 ms) {
  U32 cnt = 0, vals = 0, vale = 0;

start:
  if (!calDelay) {                      /* If not calibrated                  */
    cnt = 1000;
    if (!(SysTick->CTRL & SysTick_CTRL_ENABLE_Msk)) {
                                        /* If SysTick timer not running       */
      vals = 0xFFFFFF;
      SysTick->LOAD  = 0xFFFFFF;
      SysTick->VAL   = 0xFFFFFF;
      SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk | 
                       SysTick_CTRL_ENABLE_Msk;
    } else {
      vals = SysTick->VAL;              /* Timer start value                  */
    }
  } else {
    cnt = ms * calDelay;
  }

  while (cnt--);

  if (!calDelay) {                      /* If not calibrated                  */
    vale = SysTick->VAL;                /* Timer end value                    */
    if (vale >= vals)                   /* If timer reloaded                  */
      vals += SysTick->LOAD;
    SystemCoreClockUpdate();            /* Update information on core clock   */
    calDelay = SystemCoreClock / (vals - vale);   /* Calibrated value         */
    if (vals == 0xFFFFFF)               /* Stop timer if we started it        */
      SysTick->CTRL  = 0;
    goto start;
  }
}


/*------------------------- USBH_Pins_Config -----------------------------------
 *
 *  Configurate or unconfigurate pins used by the USB Host
 *
 *  Parameter:  on:         __TRUE = configurate, __FALSE = unconfigurate
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_Pins_Config (BOOL on) {

  /* Enable PTE31 (overcurrent flag) and PTB11 (VBUS drive enable)            */
  SIM->SCGC5    |=  SIM_SCGC5_PORTB_MASK; /* Enable Port B Clock              */
  SIM->SCGC5    |=  SIM_SCGC5_PORTE_MASK; /* Enable Port E Clock              */
  PTE->PDDR     &= ~(1UL << 31);        /* PTE31 is input                     */
  PORTE->PCR[31] =  (1   <<  8);        /* PTE31 is GPIO pin, no pull-up/down */
  PTB->PDDR     |=  (1   << 11);        /* PTB11 is output                    */
  PORTB->PCR[11] =  (1   <<  8);        /* PTB11 is GPIO pin                  */

  return (__TRUE);
}


/*------------------------- USBH_Init ------------------------------------------
 *
 *  Initialize or uninitialize the USB Host Controller
 *
 *  Parameter:  on:         __TRUE = initialize, __FALSE = uninitialize
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_Init (BOOL on) {

  if (on) {
    USBH_Delay_ms (10);                           /* To calibrate delay       */

    /* Initialize memory pool for data                                        */
    if (!usbh_mem_init(0, (U32 *)USBH_MK_MPOOL, USBH_MK_SZ_MPOOL))
      return (__FALSE);

    /* Enable all clocks needed for USB to function                           */
    /* Set USB clock to 48 MHz                                                */
    SIM->SOPT2   |=   SIM_SOPT2_USBSRC_MASK     | /* MCGPLLCLK used as src    */
                      SIM_SOPT2_PLLFLLSEL_MASK  ; /* Select MCGPLLCLK as clock*/
    SIM->SCGC4   |=   SIM_SCGC4_USBOTG_MASK;      /* Enable USBOTG clock      */

    /* Initialize the USB controller                                          */
    USB0->USBTRC0|=   USB_USBTRC0_USBRESET_MASK;  /* Reset the USB controller */
    while (USB0->USBTRC0 & USB_USBTRC0_USBRESET_MASK);      /* Wait to finish */
    USB0->USBCTRL =   0;                          /* Reset USB CTRL register  */
    USB0->USBCTRL|=   USB_USBCTRL_PDE_MASK;       /* Ena weak PD              */
    USB0->CTL    |=   USB_CTL_ODDRST_MASK;        /* ODD reset                */
    USB0->BDTPAGE1= ((U32)USBH_MK_BDT >>  8)&0xFE;/* BDT address bit  9-15    */
    USB0->BDTPAGE2= ((U32)USBH_MK_BDT >> 16);     /* BDT address bit 16-23    */
    USB0->BDTPAGE3= ((U32)USBH_MK_BDT >> 24);     /* BDT address bit 24-31    */
    USB0->SOFTHLD =   1;                          /* Max threshold            */
    USB0->CTL     =   USB_CTL_HOSTMODEEN_MASK;    /* Enable Host mode         */
    USB0->ISTAT   =   0xFF;                       /* Clear all interrupts     */
    USB0->INTEN   =   USB_INTEN_ATTACHEN_MASK;    /* Enable ATTACH interrupt  */
    NVIC_SetPriority (USB0_IRQn, 0);    /* Set USB interrupt highest priority */
    NVIC_EnableIRQ   (USB0_IRQn);       /* Enable USB interrupt               */
  } else {
    NVIC_DisableIRQ  (USB0_IRQn);       /* Disable OTG interrupt              */

    /* Reset all initialized values to reset state                            */
    USB0->USBTRC0|=   USB_USBTRC0_USBRESET_MASK;  /* Reset the USB controller */
    while (USB0->USBTRC0 & USB_USBTRC0_USBRESET_MASK);      /* Wait to finish */
    SIM->SCGC4   &=  ~SIM_SCGC4_USBOTG_MASK;      /* Disable USBOTG clock     */
    SIM->SOPT2   &= ~(SIM_SOPT2_PLLFLLSEL_MASK | 
                      SIM_SOPT2_USBSRC_MASK)   ;

    calDelay      = 0;                            /* Force delay recalibrate  */
  }

  return (__TRUE);
}


/*------------------------- USBH_Port_Power ------------------------------------
 *
 *  Turn USB Host port power on or off
 *
 *  Parameter:  on:         __TRUE = power on, __FALSE = power off
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_Port_Power (BOOL on) {

  if (on) 
    PTB->PSOR = (1 << 11);              /* PTB11 = 1 -> Drive ENA high        */
  else 
    PTB->PCOR = (1 << 11);              /* PTB11 = 0 -> Drive ENA low         */

  return (__TRUE);
}


