MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_MKL25Z4.c
  if ((istat & (1 << 0)) && Port_Con) { /* If RESET and port was connected    */
    Port_Discon_Evt  =  __TRUE;         /* Port disconnect event              */
    Port_Con         =  0;              /* Device is disconnected             */
  }

  if (Port_Discon_Evt) {                          /* If disconnect detected   */
    Port_Speed       =  0;              /* Clear port speed                   */
    USB0->ADDR       =  0;              /* Clear address                      */
    USB0->CTL       &= ~USB_CTL_USBENSOFEN_MASK;      /* Disable SOFs         */
    USB0->INTEN      =  USB_INTEN_ATTACHEN_MASK;      /* Enable ATTACH int    */
    for (ep = 0; ep < (OTG_MAX_EP*2); ep++){/* Go through all endpoints       */
      ptr_URB = USBH_DEV_EP[ep].ptr_URB;/* Pointer to endpoint's URB          */
      if (ptr_URB)                      /* If pointer is valid                */
        USBH_URB_Cancel ((U32)&USBH_DEV_EP[ep], ptr_URB);
    }
  }

  if (istat & (1 << 2)) {               /* If start of frame interrupt        */

                                        /* Check transfer timeout             */
    for (ep = 0; ep < (OTG_MAX_EP*2); ep++){/* Go through all endpoints       */
      ptr_URB = USBH_DEV_EP[ep].ptr_URB;/* Pointer to endpoint's URB          */
      if (ptr_URB) {                    /* If pointer is valid                */
        if (ptr_URB->TimeoutCount--) {
          if (!ptr_URB->TimeoutCount) {
            ptr_URB->Timeout = 1;       /* If timeout expired                 */
          }
        }
      }
    }

    if (!HW_Busy) {
                                        /* Handle start of control transfers  */
      for (ep = 0; ep<(OTG_MAX_EP*2); ep++){  /* Go through all endpoints     */
        ptr_URB=USBH_DEV_EP[ep].ptr_URB;/* Pointer to endpoint's URB          */
        if (ptr_URB) {                  /* If pointer is valid                */
          if ((USBH_DEV_EP[ep].EP_DESC.bmAttributes & USB_ENDPOINT_TYPE_MASK) == USB_ENDPOINT_TYPE_CONTROL) {
            if ((ptr_URB->Submitted  == 1) &&     /* If URB is submitted      */
              (ptr_URB->InProgress == 0)) {       /* If URB not in progress   */
              ptr_URB->InProgress = 1;
              USBH_MK_TransferEnqueue ((U32)&USBH_DEV_EP[ep], (U8)ptr_URB->Parameters, (U8 *)ptr_URB->ptrCurrentDataBuffer, (U32)ptr_URB->DataLength-(U32)ptr_URB->DataTransferred);
              break;
            }
          }
        }
      }
    }
                                        /* Handle start of interrupt transfers*/
    for (ep = 0; ep<(OTG_MAX_EP*2); ep++){    /* Go through all endpoints     */
      ptr_URB=USBH_DEV_EP[ep].ptr_URB;  /* Pointer to endpoint's URB          */
      if (ptr_URB) {                    /* If pointer is valid                */
        if ((USBH_DEV_EP[ep].EP_DESC.bmAttributes & USB_ENDPOINT_TYPE_MASK) == USB_ENDPOINT_TYPE_INTERRUPT) {
          if ((ptr_URB->Submitted  == 1) &&       /* If URB is submitted      */
              (ptr_URB->InProgress == 0)) {       /* If URB not in progress   */
            if (USBH_DEV_EP[ep].cntInterval) {
              if (!HW_Busy) {
                USBH_DEV_EP[ep].cntInterval--;
                if (!USBH_DEV_EP[ep].cntInterval){/* If period expired        */
                  ptr_URB->InProgress = 1;
                  USBH_MK_TransferEnqueue ((U32)&USBH_DEV_EP[ep], (U8)ptr_URB->Parameters, (U8 *)ptr_URB->ptrCurrentDataBuffer, (U32)ptr_URB->DataLength-(U32)ptr_URB->DataTransferred);
                }
              } else {
                if (USBH_DEV_EP[ep].cntInterval > 1) 
                  USBH_DEV_EP[ep].cntInterval--;
              }
            }
          }
        }
      }
    }
    if (!HW_Busy) {
                                        /* Handle start of bulk transfers     */
      for (ep = 0; ep<(OTG_MAX_EP*2); ep++){  /* Go through all endpoints     */
        ptr_URB=USBH_DEV_EP[ep].ptr_URB;/* Pointer to endpoint's URB          */
        if (ptr_URB) {                  /* If pointer is valid                */
          if ((USBH_DEV_EP[ep].EP_DESC.bmAttributes & USB_ENDPOINT_TYPE_MASK) == USB_ENDPOINT_TYPE_BULK) {
            if ((ptr_URB->Submitted  == 1) &&     /* If URB is submitted      */
              (ptr_URB->InProgress == 0)) {       /* If URB not in progress   */
              ptr_URB->InProgress = 1;
              USBH_MK_TransferEnqueue ((U32)&USBH_DEV_EP[ep], (U8)ptr_URB->Parameters, (U8 *)ptr_URB->ptrCurrentDataBuffer, (U32)ptr_URB->DataLength-(U32)ptr_URB->DataTransferred);
              break;
            }
          }
        }
      }
    }
  }

  USB0->ISTAT = istat;                  /* Clear handled interrupts           */
}
